
clc; clear; close all;

%% =======================
% 原始数据
% 列顺序：[Input, H6, H12, H18, H24]
%% =======================

Y_raw = [
    
0.29154486	0.205263805	0.256032454	0.256292569	0.244746945
0.588731404	0.413565369	0.508330683	0.510961341	0.48235418
0.89129219	0.620931797	0.760242797	0.762428075	0.722860149
1.19512124	0.832606094	1.016236936	1.016525461	0.964518097
1.509054904	1.053922508	1.282707581	1.275058036	1.221554155

];

% 将 NaN 替换成实际 H6、H12、H18 数据

%% =======================
% 零载荷补零
%% =======================

Y = [zeros(1, size(Y_raw,2)); Y_raw];

%% =======================
% 横轴：实际输入力
%% =======================

x = Y(:,1);

%% =======================
% 颜色定义
% 绘图顺序：24、18、12、6 Channels
%% =======================

%% =======================

cInput = [0.60 0.00 0.10];   % 深红色：Reference

colorSet = [
    0.00 0.35 0.60;   % 24 Channels 深蓝色
    0.72 0.42 0.10;   % 18 Channels 深橙色
    0.20 0.48 0.22;   % 12 Channels 深绿色
    0.41 0.28 0.55;   % 6 Channels  深紫色
];

%% =======================
% 绘图
%% =======================

figure('Color','w', ...
       'Position',[200 150 760 560]);

hold on;
grid on;
box on;

% Input：深红色实心三角形
plot(x, Y(:,1), '-^', ...
    'Color', cInput, ...
    'LineWidth', 1.8, ...
    'MarkerSize', 4, ...
    'MarkerFaceColor', cInput);

% 24、18、12、6 Channels：空心圆点
plot_columns = [5 4 3 2];

for i = 1:4
    plot(x, Y(:,plot_columns(i)), '-o', ...
        'Color', colorSet(i,:), ...
        'LineWidth', 1.8, ...
        'MarkerSize', 4, ...
        'MarkerFaceColor', 'none');
end

%% =======================
% 坐标轴与标题
%% =======================

xlabel('Reference Moment (N·m)');
ylabel('Measured Moment (N·m)');


%% =======================
% 图例
%% =======================

lgd=legend({'Input Mx', ...
        'Fault-Free Condition', ...
        'Condition 1', ...
        'Condition 2', ...
        'Condition 3'}, ...
        'Location','northwest');
lgd.Box = 'off';
%% =======================
% 字体设置
%% =======================

set(gca, ...
    'FontName','Times New Roman', ...
    'FontSize',12, ...
    'LineWidth',1);

hold off;
